In [1]:
import pandas as pd
#import csv
import unidecode

In [2]:
df = pd.read_csv('./data/ref/countries_info.csv')

In [4]:
for col in df.convert_dtypes().select_dtypes(include=['string']).columns:
    df[col] = df[col].fillna('N/A').apply(lambda x: unidecode.unidecode(x))

In [5]:
df_group = df.loc[df['region']!='N/A', ['name', 'region']]

In [6]:
df_group

                  name   region
0          Afghanistan     Asia
1        Aland Islands   Europe
2              Albania   Europe
3              Algeria   Africa
4       American Samoa  Oceania
..                 ...      ...
244  Wallis and Futuna  Oceania
245     Western Sahara   Africa
246              Yemen     Asia
247             Zambia   Africa
248           Zimbabwe   Africa

[248 rows x 2 columns]

In [ ]:
df_group.to_pickle('./data/ref/parsed-country-region.pkl')

In [ ]:
df[df['region']=='N/A']

In [10]:
def myfunc(inp=None):
    if inp==None:
        print('Nothing')
    else:
        print('This is a {}'.format(inp))

In [12]:
myfunc(2)

This is a 2

In [71]:
class testing():
    def __init__(self, data):
        self.data = data
        
    def myaggregate(self, df, kind):
        if kind=='mean':
            return df.mean(axis=0)
        if kind=='sum':
            return df.mean(axis=0)
        
    def groupby(self):
        return self.data.groupby(['State']).apply(myaggregate, 'mean')

In [76]:
t = testing(test)

In [103]:
results = t.groupby().reset_index().melt(id_vars='State')
results

  State    variable    value
0    CA  Population  22500.0
1    NY  Population  30000.0
2    TX  Population  12500.0
3    CA        Size     22.5
4    NY        Size     30.0
5    TX        Size     12.5

In [99]:
results

  State    variable    value State-variable          Group
0    CA  Population  22500.0  CA-Population  CA-Population
1    NY  Population  30000.0  NY-Population  NY-Population
2    TX  Population  12500.0  TX-Population  TX-Population
3    CA        Size     22.5        CA-Size        CA-Size
4    NY        Size     30.0        NY-Size        NY-Size
5    TX        Size     12.5        TX-Size        TX-Size

In [112]:
results['Group'] = results['State'] + ' ' + results['variable']
results_t = results[['Group', 'value']].set_index('Group').T
results_t

Group  CA Population  NY Population  TX Population  CA Size  NY Size  TX Size
value        22500.0        30000.0        12500.0     22.5     30.0     12.5

In [75]:
test = pd.DataFrame({'City': ['San Jose', 'Austin', 'New York', 'Dallas', 'Sacramento'],
                    'State': ['CA', 'TX', 'NY', 'TX', 'CA'],
                    'Population': [20000, 10000, 30000, 15000, 25000],
                    'Size': [20, 10, 30, 15, 25]})
to_join = pd.DataFrame({'Name': ['Aaron', 'Skyler', 'Tong'],
                       'City': ['San Jose', 'Austin', 'Newark']})

In [70]:
test.groupby(['State']).apply(myaggregate, 'mean')

       Population
State
CA           22.5
NY           30.0
TX           12.5

In [24]:
test.merge(to_join, on='Name', copy=False)

     Name  Age State      City
0   Aaron   24    CA  San Jose
1  Skyler   26    TX    Austin

In [32]:
test2 = pd.DataFrame({'Age': [20, 30],
                     'Height': [1.81, 1.75]})

test2
#agg(test2)

   Age  Height
0   20    1.81
1   30    1.75

In [ ]:
#with open('./data/ref/countries_info.csv', newline='') as csvfile:
#    country_ref = list(csv.reader(csvfile))

# print(type(country_ref[0][0]))
# print(country_ref[2])

#print(country_ref[2][0])

#for i in range(0, len(country_ref)):
#    for j in range(0, len(country_ref[0])):
#        country_ref[i][j] = unidecode.unidecode(country_ref[i][j])

#print(country_ref[2][0])
#print(country_ref[1])